Revit 2026 API

# AirHeatExchangerType Enumeration

---

The type of air loop.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AirHeatExchangerType
```
```vb
Public Enumeration AirHeatExchangerType
```
```cpp
public enum class AirHeatExchangerType
```
```fsharp
type AirHeatExchangerType
```

| Member name | Value | Description |
| --- | --- | --- |
| Enthalpy | 1 |  |
| None | 0 |  |
| Sensible | 2 |  |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace